_posts/2016-07-21-tcp_wrapper.html
---
title: "TCP_Wrapper"
date: 2016-07-21
layout: post
categories: 
- Linux管理
tags: 
- Linux 
- 安全
published: true
comments: 
---
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgheadline1">1. tcp_wrapper</a></li>
<li><a href="#orgheadline5">2. 配置</a>
<ul>
<li><a href="#orgheadline2">配置文件</a></li>
<li><a href="#orgheadline3">配置语法</a></li>
<li><a href="#orgheadline4">示例</a></li>
</ul>
</li>
</ul>
</div>
</div>


<div id="outline-container-orgheadline1" class="outline-2">
<h2 id="orgheadline1"><span class="section-number-2">1</span> tcp_wrapper</h2>
<div class="outline-text-2" id="text-1">
<p>
<code>tcp_wrapper</code> 对基于tcp协议开发并提供服务的应用程序，提供的一层访问控制工具
</p>
<ul class="org-ul">
<li><code>tcp_wrapper</code> 是基于 <code>libwrap</code> 库调用实现其功能，即程序需要调用该库才能支持tcp_wrapper</li>
<li>使用 <code>ldd</code> 命令可以判断程序是否依赖于 <code>libwrap</code> 库</li>
</ul>
</div>
</div>
<div id="outline-container-orgheadline5" class="outline-2">
<h2 id="orgheadline5"><span class="section-number-2">2</span> 配置</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-orgheadline2" class="outline-3">
<h3 id="orgheadline2">配置文件</h3>
<div class="outline-text-3" id="text-orgheadline2">
<dl class="org-dl">
<dt>配置文件组成</dt><dd><ul class="org-ul">
<li><code>/etc/hosts.allow</code></li>
<li><code>/etc/hosts.deny</code></li>
</ul></dd>
<dt>权限检查过程</dt><dd>权限检查时先检查 <code>allow</code> 文件后检查 <code>deny</code> 文件，若都没匹配则允许</dd>
</dl>
</div>
</div>
<div id="outline-container-orgheadline3" class="outline-3">
<h3 id="orgheadline3">配置语法</h3>
<div class="outline-text-3" id="text-orgheadline3">
<div class="org-src-container">

<pre class="src src-yaml"><span style="color: #FD971F;">daemon_list</span>: client_list [:options]
  <span style="color: #FD971F;">daemon_list</span>: &#24212;&#29992;&#31243;&#24207;&#30340;&#25991;&#20214;&#21517;&#31216;&#65292;&#32780;&#38750;&#26381;&#21153;&#21517;&#65292;&#21487;&#20351;&#29992;&#20197;&#36887;&#21495;&#20998;&#38548;&#30340;&#21015;&#34920;
    <span style="color: #FD971F;">ALL</span>: &#25152;&#26377;&#26381;&#21153;

  <span style="color: #FD971F;">client_list</span>:
    IP&#22320;&#22336;
    &#20027;&#26426;&#21517;
    &#31616;&#30701;&#26684;&#24335;&#30340;&#32593;&#32476;&#22320;&#22336;&#65292;&#22914;172.16.
    <span style="color: #FD971F;">ALL</span>: &#25152;&#26377;&#20027;&#26426;
    <span style="color: #FD971F;">EXCEPT</span>: &#19981;&#21305;&#37197;&#20027;&#26426;

  <span style="color: #FD971F;">options</span>: 
    <span style="color: #FD971F;">deny</span>: &#22312;allow&#25991;&#20214;&#20013;&#20351;&#29992;deny
    <span style="color: #FD971F;">allow</span>: &#22312;deny&#25991;&#20214;&#20013;&#20351;&#29992;allow
    <span style="color: #FD971F;">spawn</span>: &#21551;&#21160;&#39069;&#22806;&#24212;&#29992;&#31243;&#24207;&#65292;&#24120;&#29992;&#20110;&#35760;&#24405;&#26085;&#24535;
</pre>
</div>
</div>
</div>
<div id="outline-container-orgheadline4" class="outline-3">
<h3 id="orgheadline4">示例</h3>
<div class="outline-text-3" id="text-orgheadline4">
<div class="org-src-container">

<pre class="src src-yaml"><span style="color: #FD971F;">vsftpd</span>: 172.16. EXCEPT 172.16.100.0/255.255.255.0 EXCEPT 172.16.100.1  <span style="color: #75715E;"># </span><span style="color: #75715E;">&#19981;&#21253;&#21547;&#38500;172.16.100.1&#22806;&#30340;172.16.100.0&#32593;&#27573;&#30340;IP</span>

<span style="color: #FD971F;">vsftpd</span>: ALL :spawn /bin/echo `date` login attempt from %c to %s, %d &gt;&gt; /var/log/vsftpd.deny.log  <span style="color: #75715E;"># </span><span style="color: #75715E;">&#20351;&#29992;spawn&#26469;&#25191;&#34892;&#35760;&#24405;&#26085;&#24535;</span>
  <span style="color: #FD971F;">%c</span>: client ip
  <span style="color: #FD971F;">%s</span>: server ip
  <span style="color: #FD971F;">%d</span>: daemon name
</pre>
</div>
</div>
</div>
</div>
